; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=67, out_folder=htg/blocksworld//training, instance_id=47, seed=2071

(define (problem blocksworld-47)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 - object)
 (:init 
    (arm-empty)
    (clear b45)
    (on b45 b14)
    (on-table b14)
    (clear b11)
    (on b11 b48)
    (on b48 b32)
    (on b32 b50)
    (on b50 b28)
    (on b28 b19)
    (on b19 b4)
    (on b4 b5)
    (on b5 b63)
    (on b63 b43)
    (on b43 b27)
    (on b27 b38)
    (on b38 b23)
    (on b23 b59)
    (on b59 b61)
    (on b61 b13)
    (on b13 b51)
    (on b51 b26)
    (on b26 b36)
    (on b36 b9)
    (on-table b9)
    (clear b7)
    (on b7 b40)
    (on-table b40)
    (clear b35)
    (on b35 b47)
    (on b47 b46)
    (on-table b46)
    (clear b53)
    (on b53 b39)
    (on b39 b24)
    (on b24 b62)
    (on-table b62)
    (clear b55)
    (on b55 b34)
    (on b34 b25)
    (on b25 b17)
    (on b17 b67)
    (on b67 b42)
    (on b42 b60)
    (on b60 b3)
    (on b3 b2)
    (on b2 b15)
    (on b15 b52)
    (on b52 b21)
    (on b21 b18)
    (on b18 b37)
    (on b37 b49)
    (on b49 b57)
    (on b57 b64)
    (on b64 b58)
    (on b58 b65)
    (on b65 b10)
    (on-table b10)
    (clear b66)
    (on b66 b30)
    (on b30 b12)
    (on b12 b8)
    (on b8 b56)
    (on b56 b41)
    (on b41 b22)
    (on b22 b44)
    (on b44 b31)
    (on b31 b33)
    (on b33 b6)
    (on b6 b54)
    (on-table b54)
    (clear b16)
    (on b16 b29)
    (on b29 b20)
    (on b20 b1)
    (on-table b1))
 (:goal  (and 
    (clear b4)
    (on b4 b3)
    (on b3 b6)
    (on b6 b2)
    (on b2 b1)
    (on-table b1)
    (clear b5)
    (on-table b5))))

; plan
1. (unstack b11 b48)
   deleted: (on b11 b48) (clear b11) (arm-empty)
   added: (holding b11) (clear b48)
   goals met: 1 of 8
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 8
3. (unstack b48 b32)
   deleted: (on b48 b32) (clear b48) (arm-empty)
   added: (holding b48) (clear b32)
   goals met: 1 of 8
4. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 1 of 8
5. (unstack b32 b50)
   deleted: (on b32 b50) (clear b32) (arm-empty)
   added: (holding b32) (clear b50)
   goals met: 1 of 8
6. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 1 of 8
7. (unstack b50 b28)
   deleted: (on b50 b28) (clear b50) (arm-empty)
   added: (holding b50) (clear b28)
   goals met: 1 of 8
8. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 1 of 8
9. (unstack b28 b19)
   deleted: (on b28 b19) (clear b28) (arm-empty)
   added: (holding b28) (clear b19)
   goals met: 1 of 8
10. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 8
11. (unstack b19 b4)
   deleted: (on b19 b4) (clear b19) (arm-empty)
   added: (holding b19) (clear b4)
   goals met: 2 of 8
12. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 8
13. (unstack b66 b30)
   deleted: (on b66 b30) (clear b66) (arm-empty)
   added: (holding b66) (clear b30)
   goals met: 2 of 8
14. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 2 of 8
15. (unstack b30 b12)
   deleted: (on b30 b12) (clear b30) (arm-empty)
   added: (holding b30) (clear b12)
   goals met: 2 of 8
16. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 8
17. (unstack b12 b8)
   deleted: (on b12 b8) (clear b12) (arm-empty)
   added: (holding b12) (clear b8)
   goals met: 2 of 8
18. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 8
19. (unstack b8 b56)
   deleted: (on b8 b56) (clear b8) (arm-empty)
   added: (holding b8) (clear b56)
   goals met: 2 of 8
20. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 8
21. (unstack b16 b29)
   deleted: (on b16 b29) (clear b16) (arm-empty)
   added: (holding b16) (clear b29)
   goals met: 2 of 8
22. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 8
23. (unstack b29 b20)
   deleted: (on b29 b20) (clear b29) (arm-empty)
   added: (holding b29) (clear b20)
   goals met: 2 of 8
24. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 8
25. (unstack b20 b1)
   deleted: (on b20 b1) (clear b20) (arm-empty)
   added: (holding b20) (clear b1)
   goals met: 2 of 8
26. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 8
27. (unstack b55 b34)
   deleted: (on b55 b34) (clear b55) (arm-empty)
   added: (holding b55) (clear b34)
   goals met: 2 of 8
28. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 2 of 8
29. (unstack b34 b25)
   deleted: (on b34 b25) (clear b34) (arm-empty)
   added: (holding b34) (clear b25)
   goals met: 2 of 8
30. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 2 of 8
31. (unstack b25 b17)
   deleted: (on b25 b17) (clear b25) (arm-empty)
   added: (holding b25) (clear b17)
   goals met: 2 of 8
32. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 8
33. (unstack b17 b67)
   deleted: (on b17 b67) (clear b17) (arm-empty)
   added: (holding b17) (clear b67)
   goals met: 2 of 8
34. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 8
35. (unstack b67 b42)
   deleted: (on b67 b42) (clear b67) (arm-empty)
   added: (holding b67) (clear b42)
   goals met: 2 of 8
36. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 2 of 8
37. (unstack b42 b60)
   deleted: (on b42 b60) (clear b42) (arm-empty)
   added: (holding b42) (clear b60)
   goals met: 2 of 8
38. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 2 of 8
39. (unstack b60 b3)
   deleted: (on b60 b3) (clear b60) (arm-empty)
   added: (holding b60) (clear b3)
   goals met: 2 of 8
40. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 2 of 8
41. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 2 of 8
42. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 4 of 8
43. (unstack b5 b63)
   deleted: (on b5 b63) (clear b5) (arm-empty)
   added: (holding b5) (clear b63)
   goals met: 3 of 8
44. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 8
45. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 3 of 8
46. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 8
47. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 4 of 8
48. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 8
49. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 4 of 8
50. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 5 of 8
51. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 8
52. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 6 of 8
53. (unstack b56 b41)
   deleted: (on b56 b41) (clear b56) (arm-empty)
   added: (holding b56) (clear b41)
   goals met: 6 of 8
54. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 6 of 8
55. (unstack b41 b22)
   deleted: (on b41 b22) (clear b41) (arm-empty)
   added: (holding b41) (clear b22)
   goals met: 6 of 8
56. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 6 of 8
57. (unstack b22 b44)
   deleted: (on b22 b44) (clear b22) (arm-empty)
   added: (holding b22) (clear b44)
   goals met: 6 of 8
58. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 6 of 8
59. (unstack b44 b31)
   deleted: (on b44 b31) (clear b44) (arm-empty)
   added: (holding b44) (clear b31)
   goals met: 6 of 8
60. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 6 of 8
61. (unstack b31 b33)
   deleted: (on b31 b33) (clear b31) (arm-empty)
   added: (holding b31) (clear b33)
   goals met: 6 of 8
62. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 6 of 8
63. (unstack b33 b6)
   deleted: (on b33 b6) (clear b33) (arm-empty)
   added: (holding b33) (clear b6)
   goals met: 6 of 8
64. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 6 of 8
65. (unstack b6 b54)
   deleted: (on b6 b54) (clear b6) (arm-empty)
   added: (holding b6) (clear b54)
   goals met: 6 of 8
66. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 7 of 8
67. (unstack b4 b3)
   deleted: (on b4 b3) (clear b4) (arm-empty)
   added: (holding b4) (clear b3)
   goals met: 5 of 8
68. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 8
69. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 8
70. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 7 of 8
71. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 8
72. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 8 of 8
